The roof cannot be joined.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotJoinRoof { get; }
  Visual Basic
Public Shared ReadOnly Property CannotJoinRoof As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotJoinRoof {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures JoinElementsFailures Class
  Autodesk.Revit.DB Namespace